{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 512,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 512
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "\n": 2,
      "#": 3,
      "%": 4,
      "(": 5,
      ")": 6,
      "*": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "=": 22,
      "@": 23,
      "A": 24,
      "B": 25,
      "C": 26,
      "D": 27,
      "E": 28,
      "F": 29,
      "G": 30,
      "H": 31,
      "I": 32,
      "K": 33,
      "L": 34,
      "M": 35,
      "N": 36,
      "O": 37,
      "P": 38,
      "R": 39,
      "S": 40,
      "T": 41,
      "U": 42,
      "V": 43,
      "W": 44,
      "X": 45,
      "Y": 46,
      "Z": 47,
      "[": 48,
      "\\": 49,
      "]": 50,
      "a": 51,
      "b": 52,
      "c": 53,
      "d": 54,
      "e": 55,
      "f": 56,
      "g": 57,
      "h": 58,
      "i": 59,
      "k": 60,
      "l": 61,
      "m": 62,
      "n": 63,
      "o": 64,
      "p": 65,
      "r": 66,
      "s": 67,
      "t": 68,
      "u": 69,
      "y": 70,
      "=C": 71,
      "CC": 72,
      "C=C": 73,
      ")C": 74,
      "C(": 75,
      "=O": 76,
      "=CC=C": 77,
      "(C": 78,
      "=O)": 79,
      "(C=C": 80,
      "[C": 81,
      "=CC=CC=C": 82,
      "(=O)": 83,
      "=N": 84,
      "C1": 85,
      "H]": 86,
      "C(=C": 87,
      ")O": 88,
      ")N": 89,
      "[C@": 90,
      "CCCC": 91,
      ".CC": 92,
      "1)C": 93,
      "C2": 94,
      "C(=O)": 95,
      "=O)C": 96,
      "=CC=C(C=C": 97,
      "(C)C": 98,
      "-]": 99,
      "=C(C=C": 100,
      "F)": 101,
      "(CC": 102,
      ".C": 103,
      "[C@@": 104,
      "C3": 105,
      "[C@@H]": 106,
      "2)C": 107,
      "(C)": 108,
      "[C@H]": 109,
      "=C(": 110,
      "C(=N": 111,
      "+]": 112,
      "CC1": 113,
      "[N": 114,
      ".C1": 115,
      "CCN": 116,
      "C(=O)C": 117,
      "(=O)N": 118,
      "CN": 119,
      "(F)": 120,
      "3)C": 121,
      "1)": 122,
      "=CC(=C": 123,
      "[O": 124,
      "(=O)O": 125,
      "C4": 126,
      "[O-]": 127,
      "C(=O)N": 128,
      ".CC1": 129,
      ".[": 130,
      "(=O)C": 131,
      ")CC": 132,
      ")OC": 133,
      "l\n": 134,
      "CCO": 135,
      "1)C2": 136,
      "N=C": 137,
      "C(C": 138,
      "=CC=CC=C2": 139,
      "S(=O)": 140,
      "4)C": 141,
      "(C2": 142,
      "C(=CC=C": 143,
      "1)N": 144,
      "(C)(C)C": 145,
      "CC2": 146,
      ".Cl\n": 147,
      "[N+]": 148,
      "C(=O)O": 149,
      "CO": 150,
      "=CC=CC=C1": 151,
      "C=N": 152,
      "=CC=CC=C3": 153,
      "(O": 154,
      "/C=C": 155,
      "C5": 156,
      "CCCCCCCC": 157,
      "2)C3": 158,
      "(F)F": 159,
      "\\\\": 160,
      "(=O)[O-]": 161,
      "2H]": 162,
      "=C(C=C(C=C": 163,
      "=C(N": 164,
      "=CC(=C(C=C": 165,
      "=CN": 166,
      "(C1": 167,
      "2)": 168,
      "[C@@H](": 169,
      "5)C": 170,
      "=CC(=CC=C": 171,
      "[C@H](": 172,
      "[C-]": 173,
      "Br": 174,
      "[2H]": 175,
      "N1": 176,
      "CCC(": 177,
      "CCN(CC": 178,
      "C=C(C=C": 179,
      "C2=C": 180,
      ")(C)C": 181,
      "2)N": 182,
      "=CC=CC=C4": 183,
      "CC3": 184,
      "(C3": 185,
      ")C)C": 186,
      "3)C4": 187,
      "=C2": 188,
      "(C(=C": 189,
      "l)C": 190,
      ")F": 191,
      ")O)O": 192,
      "[NH": 193,
      "C6": 194,
      "I\n": 195,
      ".C1=CC=C(C=C": 196,
      "[S": 197,
      "C2=CC=CC=C2": 198,
      "]\n": 199,
      ")C1": 200,
      ".I\n": 201,
      "N2": 202,
      "C1=CC=C(C=C": 203,
      "=NC=C": 204,
      "#N": 205,
      "=C(C=CC(=C": 206,
      "(F)(F)F": 207,
      "(=C": 208,
      "6)C": 209,
      "=CC2": 210,
      ".CC(C)": 211,
      "=CC=CC=C5": 212,
      ".[C": 213,
      "CCCN": 214,
      "S(=O)(=O)C": 215,
      "=CC(=CC(=C": 216,
      "C7": 217,
      "C(F)": 218,
      ")C=C": 219,
      "=C(C": 220,
      "C(C)(C)C": 221,
      "=C(C(=C": 222,
      "=CC=CC(=C": 223,
      ")C2": 224,
      "CC(C": 225,
      "1)O": 226,
      "4)C5": 227,
      ")C(=O)O": 228,
      "].[": 229,
      "3)N": 230,
      "CCC": 231,
      "/C=C\\\\": 232,
      ")O\n": 233,
      "[C@H]1": 234,
      "[C@@H]1": 235,
      "C3=CC=CC=C3": 236,
      "=NN": 237,
      "[2H])": 238,
      "[Si": 239,
      "[NH+]": 240,
      ")C(=O)N": 241,
      "=NC(=N": 242,
      ".CO": 243,
      "(C)O": 244,
      "C8": 245,
      "/C=C/": 246,
      "CCC1": 247,
      "=C1": 248,
      ")/": 249,
      "(C)C1": 250,
      "CC4": 251,
      "CC(=O)N": 252,
      "=[C-]": 253,
      "=C3": 254,
      "[Si]": 255,
      "=CC=CC=C7": 256,
      "=CC=CC=C8": 257,
      "[C@@]": 258,
      "C=CC=C": 259,
      "3)": 260,
      "=CC=C2": 261,
      ")C3": 262,
      "=CC=CC=C9": 263,
      "P(=O)": 264,
      "1)C1": 265,
      "C(=O)C2": 266,
      "C(C(": 267,
      "C(=O)C1": 268,
      "=CC=CC=C6": 269,
      "=CC2=C(C=C": 270,
      "[C@]": 271,
      "9=CC=CC=C9": 272,
      "C)N": 273,
      ".[N": 274,
      ".CC.CC": 275,
      "[N+](=O)[O-]": 276,
      "(C4": 277,
      "C=CC(=C": 278,
      "=CC(=N": 279,
      "C)C": 280,
      "C1=CC=CC=C1": 281,
      "=C4": 282,
      "F)F": 283,
      ".C.C": 284,
      "CN(CC": 285,
      ".[Na": 286,
      "5)C6": 287,
      "=C(S": 288,
      "2)O": 289,
      "(N": 290,
      "[C@H](C": 291,
      "7)C": 292,
      "CC(C)": 293,
      "[C@@H]2": 294,
      ".C1=CC=C(C=C1)C2": 295,
      "+2": 296,
      "C4=CC=CC=C4": 297,
      "1)N2": 298,
      "C(F)(F)F": 299
    },
    "merges": [
      "= C",
      "C C",
      "C =C",
      ") C",
      "C (",
      "= O",
      "=C C=C",
      "( C",
      "=O )",
      "( C=C",
      "[ C",
      "=CC=C C=C",
      "( =O)",
      "= N",
      "C 1",
      "H ]",
      "C( =C",
      ") O",
      ") N",
      "[C @",
      "CC CC",
      ". CC",
      "1 )C",
      "C 2",
      "C( =O)",
      "=O )C",
      "=CC=C (C=C",
      "(C )C",
      "- ]",
      "=C (C=C",
      "F )",
      "( CC",
      ". C",
      "[C@ @",
      "C 3",
      "[C@@ H]",
      "2 )C",
      "(C )",
      "[C@ H]",
      "=C (",
      "C( =N",
      "+ ]",
      "CC 1",
      "[ N",
      ". C1",
      "CC N",
      "C( =O)C",
      "(=O) N",
      "C N",
      "( F)",
      "3 )C",
      "1 )",
      "=C C(=C",
      "[ O",
      "(=O) O",
      "C 4",
      "[O -]",
      "C(=O) N",
      ".CC 1",
      ". [",
      "( =O)C",
      ") CC",
      ")O C",
      "l \n",
      "CC O",
      "1)C 2",
      "N =C",
      "C( C",
      "=CC=CC=C 2",
      "S (=O)",
      "4 )C",
      "(C 2",
      "C( =CC=C",
      "1 )N",
      "(C) (C)C",
      "CC 2",
      ".C l\n",
      "[N +]",
      "C(=O) O",
      "C O",
      "=CC=CC=C 1",
      "C =N",
      "=CC=CC=C 3",
      "( O",
      "/ C=C",
      "C 5",
      "CCCC CCCC",
      "2)C 3",
      "(F) F",
      "\\ \\",
      "(=O) [O-]",
      "2 H]",
      "=C(C=C (C=C",
      "=C( N",
      "=CC(=C (C=C",
      "=C N",
      "(C 1",
      "2 )",
      "[C@@H] (",
      "5 )C",
      "=C C(=CC=C",
      "[C@H] (",
      "[C -]",
      "B r",
      "[ 2H]",
      "N 1",
      "CC C(",
      "CCN (CC",
      "C=C (C=C",
      "C2 =C",
      ") (C)C",
      "2 )N",
      "=CC=CC=C 4",
      "CC 3",
      "(C 3",
      ")C )C",
      "3)C 4",
      "=C 2",
      "( C(=C",
      "l )C",
      ") F",
      ")O )O",
      "[N H",
      "C 6",
      "I \n",
      ".C1 =CC=C(C=C",
      "[ S",
      "C2 =CC=CC=C2",
      "] \n",
      ")C 1",
      ". I\n",
      "N 2",
      "C1 =CC=C(C=C",
      "=N C=C",
      "# N",
      "=C(C=C C(=C",
      "(F) (F)F",
      "( =C",
      "6 )C",
      "=C C2",
      ".CC (C)",
      "=CC=CC=C 5",
      ". [C",
      "CC CN",
      "S(=O) (=O)C",
      "=CC(=C C(=C",
      "C 7",
      "C( F)",
      ") C=C",
      "=C (C",
      "C(C )(C)C",
      "=C( C(=C",
      "=CC=C C(=C",
      ")C 2",
      "CC (C",
      "1 )O",
      "4)C 5",
      ")C (=O)O",
      "] .[",
      "3 )N",
      "CC C",
      "/C=C \\\\",
      ")O \n",
      "[C@H] 1",
      "[C@@H] 1",
      "C3 =CC=CC=C3",
      "=N N",
      "[2H] )",
      "[S i",
      "[NH +]",
      ")C (=O)N",
      "=N C(=N",
      ".C O",
      "(C )O",
      "C 8",
      "/C=C /",
      "CC C1",
      "=C 1",
      ") /",
      "(C)C 1",
      "CC 4",
      "CC (=O)N",
      "= [C-]",
      "=C 3",
      "[Si ]",
      "=CC=CC=C 7",
      "=CC=CC=C 8",
      "[C@@ ]",
      "C=C C=C",
      "3 )",
      "=CC=C 2",
      ")C 3",
      "=CC=CC=C 9",
      "P (=O)",
      "1)C 1",
      "C(=O)C 2",
      "C( C(",
      "C(=O)C 1",
      "=CC=CC=C 6",
      "=CC2 =C(C=C",
      "[C@ ]",
      "9 =CC=CC=C9",
      "C )N",
      ". [N",
      ".CC .CC",
      "[N+] (=O)[O-]",
      "(C 4",
      "C=C C(=C",
      "=C C(=N",
      "C )C",
      "C1 =CC=CC=C1",
      "=C 4",
      "F) F",
      ".C .C",
      "CN (CC",
      ".[N a",
      "5)C 6",
      "=C( S",
      "2 )O",
      "( N",
      "[C@H] (C",
      "7 )C",
      "CC (C)",
      "[C@@H] 2",
      ".C1=CC=C(C=C 1)C2",
      "+ 2",
      "C4 =CC=CC=C4",
      "1)N 2",
      "C(F) (F)F"
    ]
  }
}